In [1]:
%load_ext sql

In [2]:
%sql postgresql://localhost/udacity_project2

'Connected: @udacity_project2'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://localhost/udacity_project2
5 rows affected.

[(1, datetime.datetime(2018, 11, 18, 2, 33, 21, 796000), 83, 'free', '', '', 693, 'Lubbock, TX', '"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"""'),
 (2, datetime.datetime(2018, 11, 18, 3, 22, 4, 796000), 40, 'free', '', '', 555, 'Oxnard-Thousand Oaks-Ventura, CA', '"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"""'),
 (3, datetime.datetime(2018, 11, 18, 9, 39, 4, 796000), 40, 'free', '', '', 698, 'Oxnard-Thousand Oaks-Ventura, CA', '"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"""'),
 (4, datetime.datetime(2018, 11, 18, 10, 18, 11, 796000), 79, 'free', '', '', 78, 'Dallas-Fort Worth-Arlington, TX', 'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0)'),
 (5, datetime.datetime(2018, 11, 18, 13, 16, 1, 796000), 29, 'paid', '', '', 589, 'Atlanta-Sandy Springs-Roswell, GA', '"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"""')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://localhost/udacity_project2
5 rows affected.

[(83, 'Stefany', 'White', 'F', 'free'),
 (40, 'Tucker', 'Garrison', 'M', 'free'),
 (79, 'James', 'Martin', 'M', 'free'),
 (29, 'Jacqueline', 'Lynch', 'F', 'paid'),
 (35, 'Molly', 'Taylor', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://localhost/udacity_project2
1 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://localhost/udacity_project2
1 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', None, None)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://localhost/udacity_project2
5 rows affected.

[(datetime.datetime(2018, 11, 18, 2, 33, 21, 796000), 2, 18, 46, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 18, 3, 22, 4, 796000), 3, 18, 46, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 18, 9, 39, 4, 796000), 9, 18, 46, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 18, 10, 18, 11, 796000), 10, 18, 46, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 18, 13, 16, 1, 796000), 13, 18, 46, 11, 2018, '6')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [8]:
%sql SELECT COUNT(*) FROM songplays;

 * postgresql://localhost/udacity_project2
1 rows affected.

[(138,)]